; ModuleID = '/home/local/ASUAD/mbalasu2/CCF-20.04/scripts/CGRALib/cgra.c'
source_filename = "/home/local/ASUAD/mbalasu2/CCF-20.04/scripts/CGRALib/cgra.c"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7-none-linux-eabi"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@totalLoops = dso_local global i32 0, align 4, !dbg !0
@dynamicTCVal = dso_local local_unnamed_addr global i32 0, align 4, !dbg !16
@initCGRA = dso_local local_unnamed_addr global i32* null, align 4, !dbg !36
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"/epilog_ins.bin\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"/prolog_ins.bin\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"/kernel_ins.bin\00", align 1
@.str.5 = private unnamed_addr constant [17 x i8] c"/CGRA_config.txt\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.8 = private unnamed_addr constant [32 x i8] c"\0A**********EPISIZE %d*********\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "totalLoops", scope: !2, file: !18, line: 30, type: !29, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/MPSLab-ASU/CCF-20.04/ 69d7c3299a1e6f5d4e7173a82d1ebc6a79ac1477)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/local/ASUAD/mbalasu2/CCF-20.04/scripts/CGRALib/cgra.c", directory: "/home/local/ASUAD/quoclon1/ccf2_git/CCF-20.04/benchmarks/Micro-benchmarks/simple_loop_1")
!4 = !{}
!5 = !{!6, !8, !7, !9, !10, !11, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !{!0, !16, !19, !22, !24, !26, !30, !32, !34, !36, !38}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dynamicTCVal", scope: !2, file: !18, line: 37, type: !11, isLocal: false, isDefinition: true)
!18 = !DIFile(filename: "mbalasu2/CCF-20.04/scripts/CGRALib/cgra.h", directory: "/home/local/ASUAD")
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "prolog", scope: !2, file: !18, line: 24, type: !21, isLocal: false, isDefinition: true)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "epilog", scope: !2, file: !18, line: 24, type: !21, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "kernel", scope: !2, file: !18, line: 24, type: !21, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "ArrPtr", scope: !2, file: !18, line: 25, type: !28, isLocal: false, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "prologPtr", scope: !2, file: !18, line: 27, type: !21, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "kernelPtr", scope: !2, file: !18, line: 27, type: !21, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "epilogPtr", scope: !2, file: !18, line: 27, type: !21, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "initCGRA", scope: !2, file: !18, line: 29, type: !10, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "pth", scope: !2, file: !18, line: 32, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !41, line: 27, baseType: !8)
!41 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/pthreadtypes.h", directory: "")
!42 = !{i32 7, !"Dwarf Version", i32 4}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 1, !"wchar_size", i32 4}
!45 = !{i32 1, !"min_enum_size", i32 4}
!46 = !{!"clang version 13.0.0 (https://github.com/MPSLab-ASU/CCF-20.04/ 69d7c3299a1e6f5d4e7173a82d1ebc6a79ac1477)"}
!47 = distinct !DISubprogram(name: "initializeParameters", scope: !48, file: !48, line: 12, type: !49, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !51)
!48 = !DIFile(filename: "mbalasu2/CCF-20.04/scripts/CGRALib/cgra.c", directory: "/home/local/ASUAD")
!49 = !DISubroutineType(types: !50)
!50 = !{!11, !29}
!51 = !{!52, !53, !54, !115, !116, !117, !118, !119, !123, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !140, !141, !142, !143, !144, !145, !146, !147}
!52 = !DILocalVariable(name: "loopID", arg: 1, scope: !47, file: !48, line: 12, type: !29)
!53 = !DILocalVariable(name: "i", scope: !47, file: !48, line: 16, type: !29)
!54 = !DILocalVariable(name: "epi", scope: !47, file: !48, line: 26, type: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !57, line: 7, baseType: !58)
!57 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types/FILE.h", directory: "")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1216, elements: !60)
!59 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types/struct_FILE.h", directory: "")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !76, !78, !79, !80, !84, !86, !88, !92, !95, !99, !102, !105, !106, !107, !110, !111}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 51, baseType: !11, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 54, baseType: !13, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 55, baseType: !13, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 56, baseType: !13, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 57, baseType: !13, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 58, baseType: !13, size: 32, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 59, baseType: !13, size: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 60, baseType: !13, size: 32, offset: 224)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 61, baseType: !13, size: 32, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 64, baseType: !13, size: 32, offset: 288)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 65, baseType: !13, size: 32, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 66, baseType: !13, size: 32, offset: 352)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 68, baseType: !74, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 36, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 70, baseType: !77, size: 32, offset: 416)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 72, baseType: !11, size: 32, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 73, baseType: !11, size: 32, offset: 480)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 74, baseType: !81, size: 32, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !82, line: 152, baseType: !83)
!82 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types.h", directory: "")
!83 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 77, baseType: !85, size: 16, offset: 544)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 78, baseType: !87, size: 8, offset: 560)
!87 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 79, baseType: !89, size: 8, offset: 568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 81, baseType: !93, size: 32, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 43, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 89, baseType: !96, size: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !82, line: 153, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !82, line: 47, baseType: !98)
!98 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !58, file: !59, line: 91, baseType: !100, size: 32, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !59, line: 37, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !58, file: !59, line: 92, baseType: !103, size: 32, offset: 736)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !59, line: 38, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !58, file: !59, line: 93, baseType: !77, size: 32, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !58, file: !59, line: 94, baseType: !9, size: 32, offset: 800)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 95, baseType: !108, size: 32, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !29)
!109 = !DIFile(filename: "sw/lib/clang/13.0.0/include/stddef.h", directory: "/home/local/ASUAD/quoclon1")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 96, baseType: !11, size: 32, offset: 864)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 98, baseType: !112, size: 320, offset: 896)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 320, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 40)
!115 = !DILocalVariable(name: "pro", scope: !47, file: !48, line: 26, type: !55)
!116 = !DILocalVariable(name: "kern", scope: !47, file: !48, line: 26, type: !55)
!117 = !DILocalVariable(name: "count", scope: !47, file: !48, line: 26, type: !55)
!118 = !DILocalVariable(name: "config", scope: !47, file: !48, line: 26, type: !55)
!119 = !DILocalVariable(name: "loopno", scope: !47, file: !48, line: 27, type: !120)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 200, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 25)
!123 = !DILocalVariable(name: "directoryPath", scope: !47, file: !48, line: 28, type: !124)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 20)
!127 = !DILocalVariable(name: "epifile", scope: !47, file: !48, line: 33, type: !112)
!128 = !DILocalVariable(name: "profile", scope: !47, file: !48, line: 34, type: !112)
!129 = !DILocalVariable(name: "kernfile", scope: !47, file: !48, line: 35, type: !112)
!130 = !DILocalVariable(name: "liveOutfile", scope: !47, file: !48, line: 36, type: !112)
!131 = !DILocalVariable(name: "configfile", scope: !47, file: !48, line: 37, type: !112)
!132 = !DILocalVariable(name: "episize", scope: !47, file: !48, line: 56, type: !11)
!133 = !DILocalVariable(name: "prosize", scope: !47, file: !48, line: 56, type: !11)
!134 = !DILocalVariable(name: "kernelsize", scope: !47, file: !48, line: 56, type: !11)
!135 = !DILocalVariable(name: "livevar_st_size", scope: !47, file: !48, line: 56, type: !11)
!136 = !DILocalVariable(name: "line", scope: !47, file: !48, line: 81, type: !137)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 256)
!140 = !DILocalVariable(name: "XDim", scope: !47, file: !48, line: 82, type: !11)
!141 = !DILocalVariable(name: "YDim", scope: !47, file: !48, line: 82, type: !11)
!142 = !DILocalVariable(name: "iter", scope: !47, file: !48, line: 83, type: !11)
!143 = !DILocalVariable(name: "II", scope: !47, file: !48, line: 97, type: !11)
!144 = !DILocalVariable(name: "epiLength", scope: !47, file: !48, line: 98, type: !11)
!145 = !DILocalVariable(name: "prolength", scope: !47, file: !48, line: 99, type: !11)
!146 = !DILocalVariable(name: "loopitfile", scope: !47, file: !48, line: 111, type: !112)
!147 = !DILocalVariable(name: "kernelCount", scope: !47, file: !48, line: 115, type: !11)
!148 = !DILocation(line: 0, scope: !47)
!149 = !DILocation(line: 15, column: 13, scope: !150)
!150 = distinct !DILexicalBlock(scope: !47, file: !48, line: 15, column: 6)
!151 = !DILocation(line: 18, column: 5, scope: !47)
!152 = !{!153, !153, i64 0}
!153 = !{!"any pointer", !154, i64 0}
!154 = !{!"omnipotent char", !155, i64 0}
!155 = !{!"Simple C/C++ TBAA"}
!156 = !DILocation(line: 18, column: 25, scope: !47)
!157 = !DILocation(line: 18, column: 17, scope: !47)
!158 = !DILocation(line: 18, column: 14, scope: !47)
!159 = !DILocation(line: 18, column: 30, scope: !47)
!160 = !{!161, !161, i64 0}
!161 = !{!"int", !154, i64 0}
!162 = !DILocation(line: 19, column: 29, scope: !47)
!163 = !DILocation(line: 19, column: 34, scope: !47)
!164 = !DILocation(line: 20, column: 29, scope: !47)
!165 = !DILocation(line: 27, column: 3, scope: !47)
!166 = !DILocation(line: 21, column: 34, scope: !47)
!167 = !DILocation(line: 27, column: 8, scope: !47)
!168 = !DILocation(line: 28, column: 3, scope: !47)
!169 = !DILocation(line: 28, column: 8, scope: !47)
!170 = !DILocation(line: 30, column: 3, scope: !47)
!171 = !DILocation(line: 31, column: 3, scope: !47)
!172 = !DILocation(line: 33, column: 3, scope: !47)
!173 = !DILocation(line: 33, column: 8, scope: !47)
