; ModuleID = 'simplified.bc'
source_filename = "/home/local/ASUAD/aabuyaz1/documents/code/ccf_1804/scripts/CGRALib/cgra.c"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7-unknown-linux-eabi"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.pthread_attr_t = type { i32, [32 x i8] }

@totalLoops = dso_local global i32 0, align 4, !dbg !0
@thread_cond_cpu = dso_local local_unnamed_addr global i32 1, align 4, !dbg !16
@thread_cond_cgra = dso_local local_unnamed_addr global i32 0, align 4, !dbg !20
@thread_exit = dso_local local_unnamed_addr global i32 0, align 4, !dbg !22
@dynamicTCVal = dso_local local_unnamed_addr global i32 0, align 4, !dbg !24
@initCGRA = dso_local local_unnamed_addr global i32* null, align 4, !dbg !42
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"/epilog_ins.bin\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"/prolog_ins.bin\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"/kernel_ins.bin\00", align 1
@.str.5 = private unnamed_addr constant [17 x i8] c"/CGRA_config.txt\00", align 1

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git 0d4534237de38fcf1b2a71bcb0f74cb5675fe7e1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/local/ASUAD/aabuyaz1/documents/code/ccf_1804/scripts/CGRALib/cgra.c", directory: "/home/local/ASUAD/aabuyaz1/documents/code/ccf_1804/benchmarks/Micro-benchmarks/simple_loop_1_Crimson")
!4 = !{}
!5 = !{!6, !8, !7, !9, !10, !11, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !{!0, !16, !20, !22, !24, !26, !29, !31, !33, !36, !38, !40, !42, !44}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "thread_cond_cpu", scope: !2, file: !18, line: 33, type: !19, isLocal: false, isDefinition: true)
!18 = !DIFile(filename: "scripts/CGRALib/cgra.h", directory: "/home/local/ASUAD/aabuyaz1/documents/code/ccf_1804")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "thread_cond_cgra", scope: !2, file: !18, line: 34, type: !19, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "thread_exit", scope: !2, file: !18, line: 35, type: !19, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "dynamicTCVal", scope: !2, file: !18, line: 37, type: !11, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "prolog", scope: !2, file: !18, line: 24, type: !28, isLocal: false, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "epilog", scope: !2, file: !18, line: 24, type: !28, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "kernel", scope: !2, file: !18, line: 24, type: !28, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "ArrPtr", scope: !2, file: !18, line: 25, type: !35, isLocal: false, isDefinition: true)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "prologPtr", scope: !2, file: !18, line: 27, type: !28, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "kernelPtr", scope: !2, file: !18, line: 27, type: !28, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "epilogPtr", scope: !2, file: !18, line: 27, type: !28, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "initCGRA", scope: !2, file: !18, line: 29, type: !10, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "pth", scope: !2, file: !18, line: 32, type: !46, isLocal: false, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !47, line: 27, baseType: !8)
!47 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/pthreadtypes.h", directory: "")
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{i32 1, !"min_enum_size", i32 4}
!52 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git 0d4534237de38fcf1b2a71bcb0f74cb5675fe7e1)"}
!53 = distinct !DISubprogram(name: "initializeParameters", scope: !54, file: !54, line: 9, type: !55, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !57)
!54 = !DIFile(filename: "scripts/CGRALib/cgra.c", directory: "/home/local/ASUAD/aabuyaz1/documents/code/ccf_1804")
!55 = !DISubroutineType(types: !56)
!56 = !{!11, !19}
!57 = !{!58, !59, !60, !121, !122, !123, !124, !125, !129, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !146, !147, !148, !149, !150, !151, !152, !153}
!58 = !DILocalVariable(name: "loopID", arg: 1, scope: !53, file: !54, line: 9, type: !19)
!59 = !DILocalVariable(name: "i", scope: !53, file: !54, line: 13, type: !19)
!60 = !DILocalVariable(name: "epi", scope: !53, file: !54, line: 23, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !64)
!63 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types/FILE.h", directory: "")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1216, elements: !66)
!65 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types/struct_FILE.h", directory: "")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !82, !84, !85, !86, !90, !92, !94, !98, !101, !105, !108, !111, !112, !113, !116, !117}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 51, baseType: !11, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 54, baseType: !13, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 55, baseType: !13, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 56, baseType: !13, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 57, baseType: !13, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 58, baseType: !13, size: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 59, baseType: !13, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 60, baseType: !13, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 61, baseType: !13, size: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 64, baseType: !13, size: 32, offset: 288)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 65, baseType: !13, size: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 66, baseType: !13, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 68, baseType: !80, size: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 36, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 70, baseType: !83, size: 32, offset: 416)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 72, baseType: !11, size: 32, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 73, baseType: !11, size: 32, offset: 480)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 74, baseType: !87, size: 32, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !88, line: 152, baseType: !89)
!88 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types.h", directory: "")
!89 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 77, baseType: !91, size: 16, offset: 544)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 78, baseType: !93, size: 8, offset: 560)
!93 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 79, baseType: !95, size: 8, offset: 568)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 81, baseType: !99, size: 32, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 43, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 89, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !88, line: 153, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !88, line: 47, baseType: !104)
!104 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !64, file: !65, line: 91, baseType: !106, size: 32, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !65, line: 37, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !64, file: !65, line: 92, baseType: !109, size: 32, offset: 736)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !65, line: 38, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !64, file: !65, line: 93, baseType: !83, size: 32, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !64, file: !65, line: 94, baseType: !9, size: 32, offset: 800)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 95, baseType: !114, size: 32, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 46, baseType: !19)
!115 = !DIFile(filename: "sw/lib/clang/13.0.0/include/stddef.h", directory: "/home/local/ASUAD/aabuyaz1")
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 96, baseType: !11, size: 32, offset: 864)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 98, baseType: !118, size: 320, offset: 896)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 320, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 40)
!121 = !DILocalVariable(name: "pro", scope: !53, file: !54, line: 23, type: !61)
!122 = !DILocalVariable(name: "kern", scope: !53, file: !54, line: 23, type: !61)
!123 = !DILocalVariable(name: "count", scope: !53, file: !54, line: 23, type: !61)
!124 = !DILocalVariable(name: "config", scope: !53, file: !54, line: 23, type: !61)
!125 = !DILocalVariable(name: "loopno", scope: !53, file: !54, line: 24, type: !126)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 200, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 25)
!129 = !DILocalVariable(name: "directoryPath", scope: !53, file: !54, line: 25, type: !130)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 20)
!133 = !DILocalVariable(name: "epifile", scope: !53, file: !54, line: 30, type: !118)
!134 = !DILocalVariable(name: "profile", scope: !53, file: !54, line: 31, type: !118)
!135 = !DILocalVariable(name: "kernfile", scope: !53, file: !54, line: 32, type: !118)
!136 = !DILocalVariable(name: "liveOutfile", scope: !53, file: !54, line: 33, type: !118)
!137 = !DILocalVariable(name: "configfile", scope: !53, file: !54, line: 34, type: !118)
!138 = !DILocalVariable(name: "episize", scope: !53, file: !54, line: 53, type: !11)
!139 = !DILocalVariable(name: "prosize", scope: !53, file: !54, line: 53, type: !11)
!140 = !DILocalVariable(name: "kernelsize", scope: !53, file: !54, line: 53, type: !11)
!141 = !DILocalVariable(name: "livevar_st_size", scope: !53, file: !54, line: 53, type: !11)
!142 = !DILocalVariable(name: "line", scope: !53, file: !54, line: 78, type: !143)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 256)
!146 = !DILocalVariable(name: "XDim", scope: !53, file: !54, line: 79, type: !11)
!147 = !DILocalVariable(name: "YDim", scope: !53, file: !54, line: 79, type: !11)
!148 = !DILocalVariable(name: "iter", scope: !53, file: !54, line: 80, type: !11)
!149 = !DILocalVariable(name: "II", scope: !53, file: !54, line: 94, type: !11)
!150 = !DILocalVariable(name: "epiLength", scope: !53, file: !54, line: 95, type: !11)
!151 = !DILocalVariable(name: "prolength", scope: !53, file: !54, line: 96, type: !11)
!152 = !DILocalVariable(name: "loopitfile", scope: !53, file: !54, line: 108, type: !118)
!153 = !DILocalVariable(name: "kernelCount", scope: !53, file: !54, line: 112, type: !11)
!154 = !DILocation(line: 0, scope: !53)
!155 = !DILocation(line: 12, column: 13, scope: !156)
!156 = distinct !DILexicalBlock(scope: !53, file: !54, line: 12, column: 6)
!157 = !DILocation(line: 15, column: 5, scope: !53)
!158 = !{!159, !159, i64 0}
!159 = !{!"any pointer", !160, i64 0}
!160 = !{!"omnipotent char", !161, i64 0}
!161 = !{!"Simple C/C++ TBAA"}
!162 = !DILocation(line: 15, column: 25, scope: !53)
!163 = !DILocation(line: 15, column: 17, scope: !53)
!164 = !DILocation(line: 15, column: 14, scope: !53)
!165 = !DILocation(line: 15, column: 30, scope: !53)
!166 = !{!167, !167, i64 0}
!167 = !{!"int", !160, i64 0}
!168 = !DILocation(line: 16, column: 29, scope: !53)
!169 = !DILocation(line: 16, column: 34, scope: !53)
!170 = !DILocation(line: 17, column: 29, scope: !53)
!171 = !DILocation(line: 24, column: 3, scope: !53)
!172 = !DILocation(line: 18, column: 34, scope: !53)
!173 = !DILocation(line: 24, column: 8, scope: !53)
!174 = !DILocation(line: 25, column: 3, scope: !53)
!175 = !DILocation(line: 25, column: 8, scope: !53)
!176 = !DILocation(line: 27, column: 3, scope: !53)
!177 = !DILocation(line: 28, column: 3, scope: !53)
!178 = !DILocation(line: 30, column: 3, scope: !53)
!179 = !DILocation(line: 30, column: 8, scope: !53)
