; ModuleID = 'temp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7--linux-eabi"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.pthread_attr_t = type { i32, [32 x i8] }

@.str = private unnamed_addr constant [20 x i8] c"a[%d]=%d\09 b[%d]=%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"c[%d]=%d\0A\00", align 1
@totalLoops = global i32 0, align 4
@thread_cond_cpu = local_unnamed_addr global i32 1, align 4
@thread_cond_cgra = local_unnamed_addr global i32 0, align 4
@thread_exit = local_unnamed_addr global i32 0, align 4
@dynamicTCVal = local_unnamed_addr global i32 0, align 4
@initCGRA = common local_unnamed_addr global i32* null, align 4
@epilog = common local_unnamed_addr global i32* null, align 4
@prolog = common local_unnamed_addr global i32* null, align 4
@kernel = common local_unnamed_addr global i32* null, align 4
@prologPtr = common local_unnamed_addr global i32* null, align 4
@epilogPtr = common local_unnamed_addr global i32* null, align 4
@kernelPtr = common local_unnamed_addr global i32* null, align 4
@pth = common global i32 0, align 4
@ArrPtr = common local_unnamed_addr global i32* null, align 4

!55 = !{!56, !57, !59, !61, !64, !67, !53, !68, !69, !16, !70}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 62, baseType: !53)
!58 = !DIFile(filename: "/home/mahesh/ccf/llvm/build/lib/clang/5.0.0/include/stddef.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!68 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!72 = !{!73, !76, !78, !80, !82, !84, !89, !91, !93, !95, !97, !100, !102, !104, !106}
!73 = !DIGlobalVariableExpression(var: !74)
!74 = distinct !DIGlobalVariable(name: "totalLoops", scope: !54, file: !75, line: 29, type: !53, isLocal: false, isDefinition: true)
!75 = !DIFile(filename: "/home/mahesh/ccf/scripts/CGRALib/cgra.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "thread_cond_cpu", scope: !54, file: !75, line: 32, type: !53, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "thread_cond_cgra", scope: !54, file: !75, line: 33, type: !53, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81)
!81 = distinct !DIGlobalVariable(name: "thread_exit", scope: !54, file: !75, line: 34, type: !53, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83)
!83 = distinct !DIGlobalVariable(name: "dynamicTCVal", scope: !54, file: !75, line: 36, type: !16, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85)
!85 = distinct !DIGlobalVariable(name: "s", scope: !50, file: !46, line: 57, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 16, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 2)
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "prolog", scope: !54, file: !75, line: 23, type: !67, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "epilog", scope: !54, file: !75, line: 23, type: !67, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "kernel", scope: !54, file: !75, line: 23, type: !67, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "ArrPtr", scope: !54, file: !75, line: 24, type: !67, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98)
!98 = distinct !DIGlobalVariable(name: "prologPtr", scope: !54, file: !75, line: 26, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "kernelPtr", scope: !54, file: !75, line: 26, type: !99, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103)
!103 = distinct !DIGlobalVariable(name: "epilogPtr", scope: !54, file: !75, line: 26, type: !99, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105)
!105 = distinct !DIGlobalVariable(name: "initCGRA", scope: !54, file: !75, line: 28, type: !69, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107)
!107 = distinct !DIGlobalVariable(name: "pth", scope: !54, file: !75, line: 31, type: !108, isLocal: false, isDefinition: true)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !109, line: 37, baseType: !110)
!109 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/pthreadtypes.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!110 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!111 = !{!112, !113, !114, !172, !173, !174, !175, !176, !180, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !206, !207, !209, !210, !213, !214, !216, !217, !218, !219, !220, !221, !222}
!112 = !DILocalVariable(name: "loopID", arg: 1, scope: !50, file: !46, line: 7, type: !53)
!113 = !DILocalVariable(name: "i", scope: !50, file: !46, line: 9, type: !53)
!114 = !DILocalVariable(name: "epi", scope: !50, file: !46, line: 19, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !117, line: 48, baseType: !118)
!117 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/stdio.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !119, line: 245, size: 1216, elements: !120)
!119 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/libio.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !141, !142, !143, !144, !147, !149, !151, !155, !158, !162, !163, !164, !165, !166, !167, !168}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !118, file: !119, line: 246, baseType: !16, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !118, file: !119, line: 251, baseType: !71, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !118, file: !119, line: 252, baseType: !71, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !118, file: !119, line: 253, baseType: !71, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !118, file: !119, line: 254, baseType: !71, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !118, file: !119, line: 255, baseType: !71, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !118, file: !119, line: 256, baseType: !71, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !118, file: !119, line: 257, baseType: !71, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !118, file: !119, line: 258, baseType: !71, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !118, file: !119, line: 260, baseType: !71, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !118, file: !119, line: 261, baseType: !71, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !118, file: !119, line: 262, baseType: !71, size: 32, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !118, file: !119, line: 264, baseType: !134, size: 32, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !119, line: 160, size: 96, elements: !136)
!136 = !{!137, !138, !140}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !135, file: !119, line: 161, baseType: !134, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !135, file: !119, line: 162, baseType: !139, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !135, file: !119, line: 166, baseType: !16, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !118, file: !119, line: 266, baseType: !139, size: 32, offset: 416)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !118, file: !119, line: 268, baseType: !16, size: 32, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !118, file: !119, line: 272, baseType: !16, size: 32, offset: 480)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !118, file: !119, line: 274, baseType: !145, size: 32, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !146, line: 131, baseType: !68)
!146 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !118, file: !119, line: 278, baseType: !148, size: 16, offset: 544)
!148 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !118, file: !119, line: 279, baseType: !150, size: 8, offset: 560)
!150 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !118, file: !119, line: 280, baseType: !152, size: 8, offset: 568)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 1)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !118, file: !119, line: 284, baseType: !156, size: 32, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !119, line: 154, baseType: null)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !118, file: !119, line: 293, baseType: !159, size: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !146, line: 132, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !146, line: 55, baseType: !161)
!161 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !118, file: !119, line: 302, baseType: !56, size: 32, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !118, file: !119, line: 303, baseType: !56, size: 32, offset: 736)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !118, file: !119, line: 304, baseType: !56, size: 32, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !118, file: !119, line: 305, baseType: !56, size: 32, offset: 800)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !118, file: !119, line: 306, baseType: !57, size: 32, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !118, file: !119, line: 308, baseType: !16, size: 32, offset: 864)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !118, file: !119, line: 310, baseType: !169, size: 320, offset: 896)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 320, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 40)
!172 = !DILocalVariable(name: "pro", scope: !50, file: !46, line: 19, type: !115)
!173 = !DILocalVariable(name: "kern", scope: !50, file: !46, line: 19, type: !115)
!174 = !DILocalVariable(name: "count", scope: !50, file: !46, line: 19, type: !115)
!175 = !DILocalVariable(name: "arch", scope: !50, file: !46, line: 19, type: !115)
!176 = !DILocalVariable(name: "loopno", scope: !50, file: !46, line: 20, type: !177)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 200, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 25)
!180 = !DILocalVariable(name: "directoryPath", scope: !50, file: !46, line: 21, type: !181)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 160, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 20)
!184 = !DILocalVariable(name: "epifile", scope: !50, file: !46, line: 26, type: !169)
!185 = !DILocalVariable(name: "profile", scope: !50, file: !46, line: 27, type: !169)
!186 = !DILocalVariable(name: "kernfile", scope: !50, file: !46, line: 28, type: !169)
!187 = !DILocalVariable(name: "liveOutfile", scope: !50, file: !46, line: 29, type: !169)
!188 = !DILocalVariable(name: "archfile", scope: !50, file: !46, line: 30, type: !169)
!189 = !DILocalVariable(name: "episize", scope: !50, file: !46, line: 49, type: !16)
!190 = !DILocalVariable(name: "prosize", scope: !50, file: !46, line: 49, type: !16)
!191 = !DILocalVariable(name: "kernelsize", scope: !50, file: !46, line: 49, type: !16)
!192 = !DILocalVariable(name: "livevar_st_size", scope: !50, file: !46, line: 49, type: !16)
!193 = !DILocalVariable(name: "CGRA_XDim", scope: !50, file: !46, line: 50, type: !16)
!194 = !DILocalVariable(name: "CGRA_YDim", scope: !50, file: !46, line: 50, type: !16)
!195 = !DILocalVariable(name: "token", scope: !50, file: !46, line: 58, type: !71)
!196 = !DILocalVariable(name: "X_flag", scope: !50, file: !46, line: 59, type: !16)
!197 = !DILocalVariable(name: "Y_flag", scope: !50, file: !46, line: 59, type: !16)
!198 = !DILocalVariable(name: "line", scope: !48, file: !46, line: 63, type: !181)
!199 = !DILocalVariable(name: "__s1_len", scope: !200, file: !46, line: 71, type: !57)
!200 = distinct !DILexicalBlock(scope: !201, file: !46, line: 71, column: 25)
!201 = distinct !DILexicalBlock(scope: !202, file: !46, line: 71, column: 24)
!202 = distinct !DILexicalBlock(scope: !203, file: !46, line: 70, column: 17)
!203 = distinct !DILexicalBlock(scope: !204, file: !46, line: 69, column: 20)
!204 = distinct !DILexicalBlock(scope: !205, file: !46, line: 68, column: 13)
!205 = distinct !DILexicalBlock(scope: !45, file: !46, line: 67, column: 13)
!206 = !DILocalVariable(name: "__s2_len", scope: !200, file: !46, line: 71, type: !57)
!207 = !DILocalVariable(name: "__s2", scope: !208, file: !46, line: 71, type: !61)
!208 = distinct !DILexicalBlock(scope: !200, file: !46, line: 71, column: 25)
!209 = !DILocalVariable(name: "__result", scope: !208, file: !46, line: 71, type: !16)
!210 = !DILocalVariable(name: "__s1_len", scope: !211, file: !46, line: 73, type: !57)
!211 = distinct !DILexicalBlock(scope: !212, file: !46, line: 73, column: 25)
!212 = distinct !DILexicalBlock(scope: !202, file: !46, line: 73, column: 24)
!213 = !DILocalVariable(name: "__s2_len", scope: !211, file: !46, line: 73, type: !57)
!214 = !DILocalVariable(name: "__s2", scope: !215, file: !46, line: 73, type: !61)
!215 = distinct !DILexicalBlock(scope: !211, file: !46, line: 73, column: 25)
!216 = !DILocalVariable(name: "__result", scope: !215, file: !46, line: 73, type: !16)
!217 = !DILocalVariable(name: "CGRAsize", scope: !50, file: !46, line: 95, type: !16)
!218 = !DILocalVariable(name: "II", scope: !50, file: !46, line: 119, type: !16)
