; ModuleID = 'temp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7--linux-eabi"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.bfile = type { %struct._IO_FILE*, i8, i8, i8, i8 }
%union.anon = type { i32 }
%union.pthread_attr_t = type { i32, [32 x i8] }

@.str = private unnamed_addr constant [3 x i8] c"01\00", align 1
@thread_cond_cpu = local_unnamed_addr global i32 1, align 4, !dbg !0
@thread_cond_cgra = local_unnamed_addr global i32 0, align 4, !dbg !11
@thread_exit = local_unnamed_addr global i32 0, align 4, !dbg !14
@dynamicTCVal = local_unnamed_addr global i32 0, align 4, !dbg !16
@initCGRA = common local_unnamed_addr global [7 x i32] zeroinitializer, align 4, !dbg !27
@epilog = common local_unnamed_addr global i32* null, align 4, !dbg !21
@prolog = common local_unnamed_addr global i32* null, align 4, !dbg !19
@kernel = common local_unnamed_addr global i32* null, align 4, !dbg !23
@pth = common global i32 0, align 4, !dbg !32
@ArrPtr = common local_unnamed_addr global i32* null, align 4, !dbg !25
@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 4

!110 = distinct !DISubprogram(name: "bstr_i", scope: !86, file: !86, line: 12, type: !111, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: true, unit: !85, variables: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{!7, !44}
!113 = !{!114, !115, !116}
!114 = !DILocalVariable(name: "cptr", arg: 1, scope: !110, file: !86, line: 12, type: !44)
!115 = !DILocalVariable(name: "i", scope: !110, file: !86, line: 14, type: !7)
!116 = !DILocalVariable(name: "j", scope: !110, file: !86, line: 14, type: !7)
!117 = !DIExpression()
!118 = !DILocation(line: 12, column: 27, scope: !110)
!119 = !DILocation(line: 14, column: 23, scope: !110)
!120 = !DILocation(line: 16, column: 14, scope: !110)
!121 = !DILocation(line: 16, column: 19, scope: !110)
!122 = !DILocation(line: 16, column: 22, scope: !110)
!123 = !{!124, !124, i64 0}
!124 = !{!"omnipotent char", !125, i64 0}
!125 = !{!"Simple C/C++ TBAA"}
!126 = !DILocation(line: 16, column: 28, scope: !110)
!127 = !DILocation(line: 16, column: 31, scope: !110)
!128 = !DILocation(line: 16, column: 7, scope: !110)
!129 = !DILocation(line: 18, column: 22, scope: !130)
!130 = distinct !DILexicalBlock(scope: !110, file: !86, line: 17, column: 7)
!131 = !DILocation(line: 19, column: 15, scope: !130)
!132 = !DILocation(line: 20, column: 21, scope: !130)
!133 = !DILocation(line: 20, column: 15, scope: !130)
!134 = !DILocation(line: 22, column: 7, scope: !110)
!135 = distinct !DISubprogram(name: "bitstring", scope: !88, file: !88, line: 31, type: !136, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !87, variables: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !44, !8, !18, !18}
!138 = !{!139, !140, !141, !142, !143, !144}
!139 = !DILocalVariable(name: "str", arg: 1, scope: !135, file: !88, line: 31, type: !44)
!140 = !DILocalVariable(name: "byze", arg: 2, scope: !135, file: !88, line: 31, type: !8)
!141 = !DILocalVariable(name: "biz", arg: 3, scope: !135, file: !88, line: 31, type: !18)
!142 = !DILocalVariable(name: "strwid", arg: 4, scope: !135, file: !88, line: 31, type: !18)
!143 = !DILocalVariable(name: "i", scope: !135, file: !88, line: 33, type: !18)
!144 = !DILocalVariable(name: "j", scope: !135, file: !88, line: 33, type: !18)
!145 = !DILocation(line: 31, column: 22, scope: !135)
!146 = !DILocation(line: 31, column: 32, scope: !135)
!147 = !DILocation(line: 31, column: 42, scope: !135)
!148 = !DILocation(line: 31, column: 51, scope: !135)
!149 = !DILocation(line: 35, column: 32, scope: !135)
!150 = !DILocation(line: 35, column: 40, scope: !135)
!151 = !DILocation(line: 35, column: 25, scope: !135)
!152 = !DILocation(line: 35, column: 18, scope: !135)
!153 = !DILocation(line: 33, column: 14, scope: !135)
!154 = !DILocation(line: 33, column: 11, scope: !135)
!155 = !DILocation(line: 36, column: 21, scope: !156)
!156 = distinct !DILexicalBlock(scope: !157, file: !88, line: 36, column: 7)
!157 = distinct !DILexicalBlock(scope: !135, file: !88, line: 36, column: 7)
!158 = !DILocation(line: 36, column: 7, scope: !157)
!159 = !DILocation(line: 37, column: 20, scope: !156)
!160 = !DILocation(line: 37, column: 17, scope: !156)
!161 = !DILocation(line: 38, column: 20, scope: !135)
!162 = !DILocation(line: 38, column: 7, scope: !135)
!163 = !DILocation(line: 38, column: 14, scope: !135)
!164 = !DILocation(line: 40, column: 29, scope: !165)
!165 = distinct !DILexicalBlock(scope: !135, file: !88, line: 39, column: 7)
!166 = !DILocation(line: 40, column: 37, scope: !165)
!167 = !DILocation(line: 40, column: 42, scope: !165)
!168 = !DILocation(line: 40, column: 22, scope: !165)
!169 = !DILocation(line: 40, column: 17, scope: !165)
!170 = !DILocation(line: 40, column: 20, scope: !165)
!171 = !DILocation(line: 41, column: 23, scope: !172)
!172 = distinct !DILexicalBlock(scope: !165, file: !88, line: 41, column: 17)
!173 = !DILocation(line: 41, column: 31, scope: !172)
!174 = !DILocation(line: 41, column: 28, scope: !172)
!175 = distinct !{!175, !162, !176}
!176 = !DILocation(line: 43, column: 7, scope: !135)
!177 = !DILocation(line: 42, column: 23, scope: !172)
!178 = !DILocation(line: 42, column: 26, scope: !172)
!179 = !DILocation(line: 42, column: 19, scope: !172)
!180 = !DILocation(line: 44, column: 12, scope: !135)
!181 = !DILocation(line: 45, column: 1, scope: !135)
!182 = distinct !DISubprogram(name: "bfopen", scope: !90, file: !90, line: 12, type: !183, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: true, unit: !89, variables: !253)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !44, !44}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "bfile", file: !187, line: 66, baseType: !188)
!187 = !DIFile(filename: "./bitops.h", directory: "/home/shail/Results-extra/MiBench/bitcount-ccf/bitcount2")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !187, line: 60, size: 64, elements: !189)
!189 = !{!190, !249, !250, !251, !252}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !188, file: !187, line: 61, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !193, line: 48, baseType: !194)
!193 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/stdio.h", directory: "/home/shail/Results-extra/MiBench/bitcount-ccf/bitcount2")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !195, line: 245, size: 1216, elements: !196)
!195 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/libio.h", directory: "/home/shail/Results-extra/MiBench/bitcount-ccf/bitcount2")
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !217, !218, !219, !220, !222, !224, !226, !230, !233, !237, !238, !239, !240, !241, !244, !245}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !194, file: !195, line: 246, baseType: !18, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !194, file: !195, line: 251, baseType: !44, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !194, file: !195, line: 252, baseType: !44, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !194, file: !195, line: 253, baseType: !44, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !194, file: !195, line: 254, baseType: !44, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !194, file: !195, line: 255, baseType: !44, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !194, file: !195, line: 256, baseType: !44, size: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !194, file: !195, line: 257, baseType: !44, size: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !194, file: !195, line: 258, baseType: !44, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !194, file: !195, line: 260, baseType: !44, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !194, file: !195, line: 261, baseType: !44, size: 32, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !194, file: !195, line: 262, baseType: !44, size: 32, offset: 352)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !194, file: !195, line: 264, baseType: !210, size: 32, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !195, line: 160, size: 96, elements: !212)
!212 = !{!213, !214, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !211, file: !195, line: 161, baseType: !210, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !211, file: !195, line: 162, baseType: !215, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !211, file: !195, line: 166, baseType: !18, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !194, file: !195, line: 266, baseType: !215, size: 32, offset: 416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !194, file: !195, line: 268, baseType: !18, size: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !194, file: !195, line: 272, baseType: !18, size: 32, offset: 480)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !194, file: !195, line: 274, baseType: !221, size: 32, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 131, baseType: !8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !194, file: !195, line: 278, baseType: !223, size: 16, offset: 544)
!223 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !194, file: !195, line: 279, baseType: !225, size: 8, offset: 560)
!225 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !194, file: !195, line: 280, baseType: !227, size: 8, offset: 568)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 1)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !194, file: !195, line: 284, baseType: !231, size: 32, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !195, line: 154, baseType: null)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !194, file: !195, line: 293, baseType: !234, size: 64, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 132, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !63, line: 55, baseType: !236)
!236 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !194, file: !195, line: 302, baseType: !9, size: 32, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !194, file: !195, line: 303, baseType: !9, size: 32, offset: 736)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !194, file: !195, line: 304, baseType: !9, size: 32, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !194, file: !195, line: 305, baseType: !9, size: 32, offset: 800)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !194, file: !195, line: 306, baseType: !242, size: 32, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 62, baseType: !7)
!243 = !DIFile(filename: "/home/shail/llvm/build/lib/clang/5.0.0/include/stddef.h", directory: "/home/shail/Results-extra/MiBench/bitcount-ccf/bitcount2")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !194, file: !195, line: 308, baseType: !18, size: 32, offset: 864)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !194, file: !195, line: 310, baseType: !246, size: 320, offset: 896)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 320, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 40)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !188, file: !187, line: 62, baseType: !45, size: 8, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rcnt", scope: !188, file: !187, line: 63, baseType: !45, size: 8, offset: 40)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !188, file: !187, line: 64, baseType: !45, size: 8, offset: 48)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcnt", scope: !188, file: !187, line: 65, baseType: !45, size: 8, offset: 56)
!253 = !{!254, !255, !256}
!254 = !DILocalVariable(name: "name", arg: 1, scope: !182, file: !90, line: 12, type: !44)
!255 = !DILocalVariable(name: "mode", arg: 2, scope: !182, file: !90, line: 12, type: !44)
!256 = !DILocalVariable(name: "bf", scope: !182, file: !90, line: 14, type: !185)
!257 = !DILocation(line: 12, column: 21, scope: !182)
!258 = !DILocation(line: 12, column: 33, scope: !182)
!259 = !DILocation(line: 16, column: 12, scope: !182)
!260 = !DILocation(line: 14, column: 15, scope: !182)
!261 = !DILocation(line: 17, column: 16, scope: !262)
!262 = distinct !DILexicalBlock(scope: !182, file: !90, line: 17, column: 11)
!263 = !DILocation(line: 17, column: 11, scope: !182)
!264 = !DILocation(line: 19, column: 18, scope: !182)
!265 = !DILocation(line: 19, column: 11, scope: !182)
!266 = !DILocation(line: 19, column: 16, scope: !182)
!267 = !{!268, !269, i64 0}
!268 = !{!"", !269, i64 0, !124, i64 4, !124, i64 5, !124, i64 6, !124, i64 7}
!269 = !{!"any pointer", !124, i64 0}
!270 = !DILocation(line: 20, column: 16, scope: !271)
!271 = distinct !DILexicalBlock(scope: !182, file: !90, line: 20, column: 11)
!272 = !DILocation(line: 20, column: 11, scope: !182)
!273 = !DILocation(line: 22, column: 13, scope: !274)
!274 = distinct !DILexicalBlock(scope: !271, file: !90, line: 21, column: 7)
!275 = !DILocation(line: 23, column: 13, scope: !274)
!276 = !DILocation(line: 25, column: 11, scope: !182)
!277 = !DILocation(line: 25, column: 16, scope: !182)
!278 = !{!268, !124, i64 5}
!279 = !DILocation(line: 26, column: 11, scope: !182)
!280 = !DILocation(line: 26, column: 16, scope: !182)
!281 = !{!268, !124, i64 7}
!282 = !DILocation(line: 27, column: 7, scope: !182)
!283 = !DILocation(line: 28, column: 1, scope: !182)
!284 = distinct !DISubprogram(name: "bfread", scope: !90, file: !90, line: 30, type: !285, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, unit: !89, variables: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!18, !185}
!287 = !{!288}
!288 = !DILocalVariable(name: "bf", arg: 1, scope: !284, file: !90, line: 30, type: !185)
!289 = !DILocation(line: 30, column: 19, scope: !284)
!290 = !DILocation(line: 32, column: 20, scope: !291)
!291 = distinct !DILexicalBlock(scope: !284, file: !90, line: 32, column: 11)
!292 = !DILocation(line: 32, column: 13, scope: !291)
!293 = !DILocation(line: 32, column: 11, scope: !284)
!294 = !{!268, !124, i64 4}
!295 = !DILocation(line: 34, column: 40, scope: !296)
!296 = distinct !DILexicalBlock(scope: !291, file: !90, line: 33, column: 7)
!297 = !DILocation(line: 34, column: 30, scope: !296)
!298 = !DILocation(line: 34, column: 24, scope: !296)
!299 = !DILocation(line: 34, column: 17, scope: !296)
!300 = !DILocation(line: 34, column: 22, scope: !296)
!301 = !DILocation(line: 35, column: 22, scope: !296)
!302 = !DILocation(line: 36, column: 7, scope: !296)
!303 = !DILocation(line: 38, column: 19, scope: !284)
!304 = !DILocation(line: 37, column: 15, scope: !284)
!305 = !DILocation(line: 38, column: 15, scope: !284)
!306 = !DILocation(line: 38, column: 32, scope: !284)
!307 = !DILocation(line: 38, column: 29, scope: !284)
!308 = !DILocation(line: 38, column: 24, scope: !284)
!309 = !DILocation(line: 38, column: 43, scope: !284)
!310 = !DILocation(line: 38, column: 7, scope: !284)
!311 = distinct !DISubprogram(name: "bfwrite", scope: !90, file: !90, line: 41, type: !312, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !89, variables: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !18, !185}
!314 = !{!315, !316}
!315 = !DILocalVariable(name: "bit", arg: 1, scope: !311, file: !90, line: 41, type: !18)
!316 = !DILocalVariable(name: "bf", arg: 2, scope: !311, file: !90, line: 41, type: !185)
!317 = !DILocation(line: 41, column: 18, scope: !311)
!318 = !DILocation(line: 41, column: 30, scope: !311)
!319 = !DILocation(line: 43, column: 20, scope: !320)
!320 = distinct !DILexicalBlock(scope: !311, file: !90, line: 43, column: 11)
!321 = !DILocation(line: 43, column: 13, scope: !320)
!322 = !DILocation(line: 43, column: 11, scope: !311)
!323 = !DILocation(line: 45, column: 23, scope: !324)
!324 = distinct !DILexicalBlock(scope: !320, file: !90, line: 44, column: 7)
!325 = !{!268, !124, i64 6}
!326 = !DILocation(line: 45, column: 19, scope: !324)
!327 = !DILocation(line: 45, column: 33, scope: !324)
!328 = !DILocation(line: 45, column: 13, scope: !324)
!329 = !DILocation(line: 46, column: 22, scope: !324)
!330 = !DILocation(line: 47, column: 7, scope: !324)
!331 = !DILocation(line: 48, column: 15, scope: !311)
!332 = !DILocation(line: 49, column: 16, scope: !311)
!333 = !DILocation(line: 50, column: 23, scope: !311)
!334 = !DILocation(line: 50, column: 16, scope: !311)
!335 = !DILocation(line: 51, column: 1, scope: !311)
!336 = distinct !DISubprogram(name: "bfclose", scope: !90, file: !90, line: 53, type: !337, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, unit: !89, variables: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !185}
!339 = !{!340}
!340 = !DILocalVariable(name: "bf", arg: 1, scope: !336, file: !90, line: 53, type: !185)
!341 = !DILocation(line: 53, column: 21, scope: !336)
!342 = !DILocation(line: 55, column: 18, scope: !336)
!343 = !DILocation(line: 55, column: 7, scope: !336)
!344 = !DILocation(line: 56, column: 12, scope: !336)
!345 = !DILocation(line: 56, column: 7, scope: !336)
!346 = !DILocation(line: 57, column: 1, scope: !336)
!347 = !DILocation(line: 21, column: 14, scope: !39)
!348 = !DILocation(line: 21, column: 26, scope: !39)
!349 = !DILocation(line: 24, column: 14, scope: !39)
!350 = !DILocation(line: 24, column: 30, scope: !39)
!351 = !DILocation(line: 48, column: 11, scope: !352)
!352 = distinct !DILexicalBlock(scope: !39, file: !40, line: 48, column: 7)
!353 = !DILocation(line: 48, column: 7, scope: !39)
!354 = !DILocation(line: 49, column: 13, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !40, line: 48, column: 15)
!356 = !{!269, !269, i64 0}
!357 = !DILocation(line: 49, column: 5, scope: !355)
!358 = !DILocation(line: 50, column: 5, scope: !355)
!359 = !DILocation(line: 52, column: 19, scope: !39)
!360 = !DILocalVariable(name: "__nptr", arg: 1, scope: !361, file: !362, line: 278, type: !365)
!361 = distinct !DISubprogram(name: "atoi", scope: !362, file: !362, line: 278, type: !363, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !46, variables: !367)
!362 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/stdlib.h", directory: "/home/shail/Results-extra/MiBench/bitcount-ccf/bitcount2")
!363 = !DISubroutineType(types: !364)
!364 = !{!18, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!367 = !{!360}
!368 = !DILocation(line: 278, column: 1, scope: !361, inlinedAt: !369)
!369 = distinct !DILocation(line: 52, column: 14, scope: !39)
!370 = !DILocation(line: 280, column: 16, scope: !361, inlinedAt: !369)
!371 = !DILocation(line: 27, column: 7, scope: !39)
!372 = !DILocation(line: 54, column: 3, scope: !39)
!373 = !DILocation(line: 25, column: 7, scope: !39)
!374 = !DILocation(line: 25, column: 18, scope: !39)
!375 = !DILocation(line: 25, column: 10, scope: !39)
!376 = !DILocation(line: 57, column: 13, scope: !377)
!377 = distinct !DILexicalBlock(scope: !378, file: !40, line: 56, column: 31)
!378 = distinct !DILexicalBlock(scope: !379, file: !40, line: 56, column: 3)
!379 = distinct !DILexicalBlock(scope: !39, file: !40, line: 56, column: 3)
!380 = !DILocation(line: 23, column: 11, scope: !39)
!381 = !DILocation(line: 26, column: 11, scope: !39)
!382 = !DILocation(line: 26, column: 8, scope: !39)
!383 = !DILocation(line: 59, column: 28, scope: !384)
!384 = distinct !DILexicalBlock(scope: !377, file: !40, line: 59, column: 5)
!385 = !DILocation(line: 56, column: 3, scope: !379)
!386 = !DILocation(line: 16, column: 13, scope: !387, inlinedAt: !392)
!387 = distinct !DILexicalBlock(scope: !388, file: !104, line: 16, column: 13)
!388 = distinct !DISubprogram(name: "bit_count", scope: !104, file: !104, line: 9, type: !54, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: true, unit: !103, variables: !389)
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "x", arg: 1, scope: !388, file: !104, line: 9, type: !8)
!391 = !DILocalVariable(name: "n", scope: !388, file: !104, line: 11, type: !18)
!392 = distinct !DILocation(line: 60, column: 8, scope: !393)
!393 = distinct !DILexicalBlock(scope: !384, file: !40, line: 59, column: 5)
!394 = !DILocation(line: 62, column: 12, scope: !377)
!395 = !DILocation(line: 23, column: 18, scope: !39)
!396 = !DILocation(line: 63, column: 16, scope: !377)
!397 = !DILocation(line: 63, column: 10, scope: !377)
!398 = !DILocation(line: 63, column: 25, scope: !377)
!399 = !DILocation(line: 24, column: 10, scope: !39)
!400 = !DILocation(line: 64, column: 12, scope: !401)
!401 = distinct !DILexicalBlock(scope: !377, file: !40, line: 64, column: 9)
!402 = !DILocation(line: 64, column: 9, scope: !377)
!403 = !DILocation(line: 68, column: 12, scope: !404)
!404 = distinct !DILexicalBlock(scope: !377, file: !40, line: 68, column: 9)
!405 = !DILocation(line: 68, column: 9, scope: !377)
!406 = !DILocation(line: 73, column: 5, scope: !377)
!407 = !DILocation(line: 75, column: 28, scope: !39)
!408 = !DILocation(line: 9, column: 26, scope: !388, inlinedAt: !392)
!409 = !DILocation(line: 11, column: 13, scope: !388, inlinedAt: !392)
!410 = !DILocation(line: 16, column: 13, scope: !388, inlinedAt: !392)
!411 = distinct !{!411, !412, !413}
!412 = !DILocation(line: 16, column: 16, scope: !387)
!413 = !DILocation(line: 18, column: 34, scope: !387)
!414 = !DILocation(line: 17, column: 16, scope: !387, inlinedAt: !392)
!415 = !DILocation(line: 18, column: 30, scope: !387, inlinedAt: !392)
!416 = !DILocation(line: 18, column: 27, scope: !387, inlinedAt: !392)
!417 = !DILocation(line: 18, column: 18, scope: !387, inlinedAt: !392)
!418 = !DILocation(line: 17, column: 15, scope: !387, inlinedAt: !392)
!419 = !DILocation(line: 60, column: 5, scope: !393)
!420 = !DILocation(line: 59, column: 53, scope: !393)
!421 = !DILocation(line: 59, column: 62, scope: !393)
!422 = !DILocation(line: 26, column: 14, scope: !39)
!423 = !DILocation(line: 59, column: 38, scope: !393)
!424 = !DILocation(line: 59, column: 5, scope: !384)
!425 = distinct !{!425, !424, !426}
!426 = !DILocation(line: 60, column: 27, scope: !384)
!427 = !DILocation(line: 11, column: 30, scope: !428, inlinedAt: !431)
!428 = distinct !DISubprogram(name: "bitcount", scope: !101, file: !101, line: 9, type: !54, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: true, unit: !100, variables: !429)
!429 = !{!430}
!430 = !DILocalVariable(name: "i", arg: 1, scope: !428, file: !101, line: 9, type: !8)
!431 = distinct !DILocation(line: 60, column: 8, scope: !393)
!432 = !DILocation(line: 11, column: 42, scope: !428, inlinedAt: !431)
!433 = !DILocation(line: 11, column: 37, scope: !428, inlinedAt: !431)
!434 = !DILocation(line: 12, column: 30, scope: !428, inlinedAt: !431)
!435 = !DILocation(line: 12, column: 42, scope: !428, inlinedAt: !431)
!436 = !DILocation(line: 12, column: 37, scope: !428, inlinedAt: !431)
!437 = !DILocation(line: 13, column: 30, scope: !428, inlinedAt: !431)
!438 = !DILocation(line: 13, column: 42, scope: !428, inlinedAt: !431)
!439 = !DILocation(line: 13, column: 37, scope: !428, inlinedAt: !431)
!440 = !DILocation(line: 14, column: 30, scope: !428, inlinedAt: !431)
!441 = !DILocation(line: 14, column: 42, scope: !428, inlinedAt: !431)
!442 = !DILocation(line: 14, column: 37, scope: !428, inlinedAt: !431)
!443 = !DILocation(line: 15, column: 30, scope: !428, inlinedAt: !431)
!444 = !DILocation(line: 15, column: 42, scope: !428, inlinedAt: !431)
!445 = !DILocation(line: 15, column: 37, scope: !428, inlinedAt: !431)
!446 = distinct !{!446, !424, !426, !447, !448}
!447 = !{!"llvm.loop.vectorize.width", i32 1}
!448 = !{!"llvm.loop.interleave.count", i32 1}
!449 = !DILocation(line: 75, column: 3, scope: !39)
!450 = !DILocation(line: 76, column: 26, scope: !39)
!451 = !DILocation(line: 76, column: 3, scope: !39)
!452 = !DILocation(line: 77, column: 3, scope: !39)
!453 = !DILocation(line: 9, column: 25, scope: !428, inlinedAt: !431)
!454 = distinct !{!454, !424, !426, !455, !447, !448}
!455 = !{!"llvm.loop.unroll.runtime.disable"}
!456 = !DILocation(line: 60, column: 8, scope: !393)
!457 = !DILocalVariable(name: "x", arg: 1, scope: !458, file: !93, line: 42, type: !8)
!458 = distinct !DISubprogram(name: "ntbl_bitcount", scope: !93, file: !93, line: 42, type: !54, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !92, variables: !459)
!459 = !{!457}
!460 = !DILocation(line: 42, column: 34, scope: !458, inlinedAt: !461)
!461 = distinct !DILocation(line: 60, column: 8, scope: !393)
!462 = !DILocation(line: 45, column: 28, scope: !458, inlinedAt: !461)
!463 = !DILocation(line: 45, column: 13, scope: !458, inlinedAt: !461)
!464 = !DILocation(line: 46, column: 44, scope: !458, inlinedAt: !461)
!465 = !DILocation(line: 46, column: 13, scope: !458, inlinedAt: !461)
!466 = !DILocation(line: 47, column: 44, scope: !458, inlinedAt: !461)
!467 = !DILocation(line: 47, column: 13, scope: !458, inlinedAt: !461)
!468 = !DILocation(line: 48, column: 44, scope: !458, inlinedAt: !461)
!469 = !DILocation(line: 48, column: 13, scope: !458, inlinedAt: !461)
!470 = !DILocation(line: 49, column: 44, scope: !458, inlinedAt: !461)
!471 = !DILocation(line: 49, column: 13, scope: !458, inlinedAt: !461)
!472 = !DILocation(line: 50, column: 44, scope: !458, inlinedAt: !461)
!473 = !DILocation(line: 50, column: 13, scope: !458, inlinedAt: !461)
!474 = !DILocation(line: 51, column: 44, scope: !458, inlinedAt: !461)
!475 = !DILocation(line: 51, column: 13, scope: !458, inlinedAt: !461)
!476 = !DILocation(line: 52, column: 44, scope: !458, inlinedAt: !461)
!477 = !DILocation(line: 52, column: 13, scope: !458, inlinedAt: !461)
!478 = !DILocation(line: 45, column: 52, scope: !458, inlinedAt: !461)
!479 = !DILocation(line: 46, column: 52, scope: !458, inlinedAt: !461)
!480 = !DILocation(line: 47, column: 52, scope: !458, inlinedAt: !461)
!481 = !DILocation(line: 48, column: 52, scope: !458, inlinedAt: !461)
!482 = !DILocation(line: 49, column: 52, scope: !458, inlinedAt: !461)
!483 = !DILocation(line: 50, column: 52, scope: !458, inlinedAt: !461)
!484 = !DILocation(line: 51, column: 52, scope: !458, inlinedAt: !461)
!485 = !DILocalVariable(name: "x", arg: 1, scope: !486, file: !93, line: 61, type: !8)
!486 = distinct !DISubprogram(name: "BW_btbl_bitcount", scope: !93, file: !93, line: 61, type: !54, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, unit: !92, variables: !487)
!487 = !{!485, !488}
!488 = !DILocalVariable(name: "U", scope: !486, file: !93, line: 67, type: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !486, file: !93, line: 63, size: 32, elements: !490)
!490 = !{!491, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !489, file: !93, line: 65, baseType: !492, size: 32)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 4)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !489, file: !93, line: 66, baseType: !8, size: 32)
!496 = !DILocation(line: 61, column: 37, scope: !486, inlinedAt: !497)
!497 = distinct !DILocation(line: 60, column: 8, scope: !393)
!498 = !DILocation(line: 67, column: 9, scope: !486, inlinedAt: !497)
!499 = !DILocation(line: 69, column: 11, scope: !486, inlinedAt: !497)
!500 = !DILocation(line: 71, column: 14, scope: !486, inlinedAt: !497)
!501 = !DILocation(line: 71, column: 32, scope: !486, inlinedAt: !497)
!502 = !DILocation(line: 72, column: 14, scope: !486, inlinedAt: !497)
!503 = !DILocation(line: 72, column: 32, scope: !486, inlinedAt: !497)
!504 = !DILocation(line: 71, column: 30, scope: !486, inlinedAt: !497)
!505 = !DILocation(line: 71, column: 48, scope: !486, inlinedAt: !497)
!506 = !DILocation(line: 72, column: 30, scope: !486, inlinedAt: !497)
!507 = !DILocalVariable(name: "x", arg: 1, scope: !508, file: !93, line: 81, type: !8)
!508 = distinct !DISubprogram(name: "AR_btbl_bitcount", scope: !93, file: !93, line: 81, type: !54, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !92, variables: !509)
!509 = !{!507, !510, !511}
!510 = !DILocalVariable(name: "Ptr", scope: !508, file: !93, line: 83, type: !95)
!511 = !DILocalVariable(name: "Accu", scope: !508, file: !93, line: 84, type: !18)
!512 = !DILocation(line: 81, column: 37, scope: !508, inlinedAt: !513)
!513 = distinct !DILocation(line: 60, column: 8, scope: !393)
!514 = !DILocation(line: 83, column: 23, scope: !508, inlinedAt: !513)
!515 = !DILocation(line: 86, column: 15, scope: !508, inlinedAt: !513)
!516 = !DILocation(line: 84, column: 11, scope: !508, inlinedAt: !513)
!517 = !DILocation(line: 87, column: 15, scope: !508, inlinedAt: !513)
!518 = !DILocation(line: 88, column: 15, scope: !508, inlinedAt: !513)
!519 = !DILocation(line: 89, column: 15, scope: !508, inlinedAt: !513)
!520 = !DILocation(line: 87, column: 12, scope: !508, inlinedAt: !513)
!521 = !DILocation(line: 88, column: 12, scope: !508, inlinedAt: !513)
!522 = !DILocation(line: 89, column: 12, scope: !508, inlinedAt: !513)
!523 = !DILocalVariable(name: "x", arg: 1, scope: !524, file: !40, line: 80, type: !8)
!524 = distinct !DISubprogram(name: "bit_shifter", scope: !40, file: !40, line: 80, type: !54, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, unit: !46, variables: !525)
!525 = !{!523, !526, !527}
!526 = !DILocalVariable(name: "i", scope: !524, file: !40, line: 82, type: !18)
!527 = !DILocalVariable(name: "n", scope: !524, file: !40, line: 82, type: !18)
!528 = !DILocation(line: 80, column: 39, scope: !524, inlinedAt: !529)
!529 = distinct !DILocation(line: 60, column: 8, scope: !393)
!530 = !DILocation(line: 82, column: 10, scope: !524, inlinedAt: !529)
!531 = !DILocation(line: 82, column: 7, scope: !524, inlinedAt: !529)
!532 = !DILocation(line: 84, column: 19, scope: !533, inlinedAt: !529)
!533 = distinct !DILexicalBlock(scope: !534, file: !40, line: 84, column: 3)
!534 = distinct !DILexicalBlock(scope: !524, file: !40, line: 84, column: 3)
!535 = !DILocation(line: 84, column: 3, scope: !534, inlinedAt: !529)
!536 = !DILocation(line: 85, column: 18, scope: !533, inlinedAt: !529)
!537 = !DILocation(line: 85, column: 7, scope: !533, inlinedAt: !529)
!538 = !DILocation(line: 84, column: 57, scope: !533, inlinedAt: !529)
!539 = !DILocation(line: 84, column: 64, scope: !533, inlinedAt: !529)
!540 = !DILocation(line: 84, column: 27, scope: !533, inlinedAt: !529)
!541 = !DILocation(line: 84, column: 21, scope: !533, inlinedAt: !529)
!542 = distinct !{!542, !543, !544}
!543 = !DILocation(line: 84, column: 3, scope: !534)
!544 = !DILocation(line: 85, column: 22, scope: !534)
!545 = !DILocation(line: 9, column: 26, scope: !388)
!546 = !DILocation(line: 11, column: 13, scope: !388)
!547 = !DILocation(line: 16, column: 13, scope: !387)
!548 = !DILocation(line: 16, column: 13, scope: !388)
!549 = !DILocation(line: 17, column: 16, scope: !387)
!550 = !DILocation(line: 18, column: 30, scope: !387)
!551 = !DILocation(line: 18, column: 27, scope: !387)
!552 = !DILocation(line: 18, column: 18, scope: !387)
!553 = !DILocation(line: 17, column: 15, scope: !387)
!554 = !DILocation(line: 19, column: 9, scope: !388)
!555 = !DILocation(line: 9, column: 25, scope: !428)
!556 = !DILocation(line: 11, column: 30, scope: !428)
!557 = !DILocation(line: 11, column: 42, scope: !428)
!558 = !DILocation(line: 11, column: 37, scope: !428)
!559 = !DILocation(line: 12, column: 30, scope: !428)
!560 = !DILocation(line: 12, column: 42, scope: !428)
!561 = !DILocation(line: 12, column: 37, scope: !428)
!562 = !DILocation(line: 13, column: 30, scope: !428)
!563 = !DILocation(line: 13, column: 42, scope: !428)
!564 = !DILocation(line: 13, column: 37, scope: !428)
!565 = !DILocation(line: 14, column: 30, scope: !428)
!566 = !DILocation(line: 14, column: 42, scope: !428)
!567 = !DILocation(line: 14, column: 37, scope: !428)
!568 = !DILocation(line: 15, column: 30, scope: !428)
!569 = !DILocation(line: 15, column: 42, scope: !428)
!570 = !DILocation(line: 15, column: 37, scope: !428)
!571 = !DILocation(line: 16, column: 7, scope: !428)
!572 = distinct !DISubprogram(name: "ntbl_bitcnt", scope: !79, file: !79, line: 38, type: !54, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, unit: !78, variables: !573)
!573 = !{!574, !575}
!574 = !DILocalVariable(name: "x", arg: 1, scope: !572, file: !79, line: 38, type: !8)
!575 = !DILocalVariable(name: "cnt", scope: !572, file: !79, line: 40, type: !18)
!576 = !DILocation(line: 38, column: 28, scope: !572)
!577 = !DILocation(line: 40, column: 30, scope: !572)
!578 = !DILocation(line: 40, column: 17, scope: !572)
!579 = !DILocation(line: 40, column: 11, scope: !572)
!580 = !DILocation(line: 42, column: 20, scope: !581)
!581 = distinct !DILexicalBlock(scope: !572, file: !79, line: 42, column: 11)
!582 = !DILocation(line: 42, column: 14, scope: !581)
!583 = !DILocation(line: 42, column: 11, scope: !572)
!584 = !DILocation(line: 43, column: 20, scope: !581)
!585 = !DILocation(line: 43, column: 17, scope: !581)
!586 = !DILocation(line: 45, column: 7, scope: !572)
!587 = !DILocation(line: 42, column: 34, scope: !458)
!588 = !DILocation(line: 45, column: 28, scope: !458)
!589 = !DILocation(line: 45, column: 13, scope: !458)
!590 = !DILocation(line: 46, column: 44, scope: !458)
!591 = !DILocation(line: 46, column: 13, scope: !458)
!592 = !DILocation(line: 45, column: 52, scope: !458)
!593 = !DILocation(line: 47, column: 44, scope: !458)
!594 = !DILocation(line: 47, column: 13, scope: !458)
!595 = !DILocation(line: 46, column: 52, scope: !458)
!596 = !DILocation(line: 48, column: 44, scope: !458)
!597 = !DILocation(line: 48, column: 13, scope: !458)
!598 = !DILocation(line: 47, column: 52, scope: !458)
!599 = !DILocation(line: 49, column: 44, scope: !458)
!600 = !DILocation(line: 49, column: 13, scope: !458)
!601 = !DILocation(line: 48, column: 52, scope: !458)
!602 = !DILocation(line: 50, column: 44, scope: !458)
!603 = !DILocation(line: 50, column: 13, scope: !458)
!604 = !DILocation(line: 49, column: 52, scope: !458)
!605 = !DILocation(line: 51, column: 44, scope: !458)
!606 = !DILocation(line: 51, column: 13, scope: !458)
!607 = !DILocation(line: 50, column: 52, scope: !458)
!608 = !DILocation(line: 52, column: 44, scope: !458)
!609 = !DILocation(line: 52, column: 13, scope: !458)
!610 = !DILocation(line: 51, column: 52, scope: !458)
!611 = !DILocation(line: 44, column: 7, scope: !458)
!612 = !DILocation(line: 61, column: 37, scope: !486)
!613 = !DILocation(line: 67, column: 9, scope: !486)
!614 = !DILocation(line: 69, column: 11, scope: !486)
!615 = !DILocation(line: 71, column: 14, scope: !486)
!616 = !DILocation(line: 71, column: 32, scope: !486)
!617 = !DILocation(line: 71, column: 30, scope: !486)
!618 = !DILocation(line: 72, column: 14, scope: !486)
!619 = !DILocation(line: 71, column: 48, scope: !486)
!620 = !DILocation(line: 72, column: 32, scope: !486)
!621 = !DILocation(line: 72, column: 30, scope: !486)
!622 = !DILocation(line: 71, column: 7, scope: !486)
!623 = !DILocation(line: 81, column: 37, scope: !508)
!624 = !DILocation(line: 83, column: 23, scope: !508)
!625 = !DILocation(line: 86, column: 15, scope: !508)
!626 = !DILocation(line: 84, column: 11, scope: !508)
!627 = !DILocation(line: 87, column: 15, scope: !508)
!628 = !DILocation(line: 87, column: 12, scope: !508)
!629 = !DILocation(line: 88, column: 15, scope: !508)
!630 = !DILocation(line: 88, column: 12, scope: !508)
!631 = !DILocation(line: 89, column: 15, scope: !508)
!632 = !DILocation(line: 89, column: 12, scope: !508)
!633 = !DILocation(line: 90, column: 7, scope: !508)
!634 = distinct !DISubprogram(name: "btbl_bitcnt", scope: !79, file: !79, line: 52, type: !54, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !78, variables: !635)
!635 = !{!636, !637}
!636 = !DILocalVariable(name: "x", arg: 1, scope: !634, file: !79, line: 52, type: !8)
!637 = !DILocalVariable(name: "cnt", scope: !634, file: !79, line: 54, type: !18)
!638 = !DIExpression(DW_OP_LLVM_fragment, 8, 24)
!639 = !DILocation(line: 52, column: 28, scope: !634)
!640 = !DILocation(line: 54, column: 39, scope: !634)
!641 = !DILocation(line: 54, column: 17, scope: !634)
!642 = !DILocation(line: 54, column: 11, scope: !634)
!643 = !DILocation(line: 56, column: 20, scope: !644)
!644 = distinct !DILexicalBlock(scope: !634, file: !79, line: 56, column: 11)
!645 = !DILocation(line: 56, column: 14, scope: !644)
!646 = !DILocation(line: 56, column: 11, scope: !634)
!647 = !DILocation(line: 57, column: 20, scope: !644)
!648 = !DILocation(line: 57, column: 17, scope: !644)
!649 = !DILocation(line: 58, column: 7, scope: !634)
!650 = distinct !DISubprogram(name: "initializeParameters", scope: !3, file: !3, line: 24, type: !651, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !653)
!651 = !DISubroutineType(types: !652)
!652 = !{!18, !7}
!653 = !{!654, !655, !656, !697, !698, !699, !700, !704, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !724}
!654 = !DILocalVariable(name: "loopID", arg: 1, scope: !650, file: !3, line: 24, type: !7)
!655 = !DILocalVariable(name: "i", scope: !650, file: !3, line: 26, type: !7)
!656 = !DILocalVariable(name: "epi", scope: !650, file: !3, line: 36, type: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !193, line: 48, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !195, line: 245, size: 1216, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !659, file: !195, line: 246, baseType: !18, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !659, file: !195, line: 251, baseType: !44, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !659, file: !195, line: 252, baseType: !44, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !659, file: !195, line: 253, baseType: !44, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !659, file: !195, line: 254, baseType: !44, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !659, file: !195, line: 255, baseType: !44, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !659, file: !195, line: 256, baseType: !44, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !659, file: !195, line: 257, baseType: !44, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !659, file: !195, line: 258, baseType: !44, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !659, file: !195, line: 260, baseType: !44, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !659, file: !195, line: 261, baseType: !44, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !659, file: !195, line: 262, baseType: !44, size: 32, offset: 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !659, file: !195, line: 264, baseType: !674, size: 32, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !195, line: 160, size: 96, elements: !676)
!676 = !{!677, !678, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !675, file: !195, line: 161, baseType: !674, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !675, file: !195, line: 162, baseType: !679, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !675, file: !195, line: 166, baseType: !18, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !659, file: !195, line: 266, baseType: !679, size: 32, offset: 416)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !659, file: !195, line: 268, baseType: !18, size: 32, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !659, file: !195, line: 272, baseType: !18, size: 32, offset: 480)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !659, file: !195, line: 274, baseType: !221, size: 32, offset: 512)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !659, file: !195, line: 278, baseType: !223, size: 16, offset: 544)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !659, file: !195, line: 279, baseType: !225, size: 8, offset: 560)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !659, file: !195, line: 280, baseType: !227, size: 8, offset: 568)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !659, file: !195, line: 284, baseType: !231, size: 32, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !659, file: !195, line: 293, baseType: !234, size: 64, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !659, file: !195, line: 302, baseType: !9, size: 32, offset: 704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !659, file: !195, line: 303, baseType: !9, size: 32, offset: 736)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !659, file: !195, line: 304, baseType: !9, size: 32, offset: 768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !659, file: !195, line: 305, baseType: !9, size: 32, offset: 800)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !659, file: !195, line: 306, baseType: !242, size: 32, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !659, file: !195, line: 308, baseType: !18, size: 32, offset: 864)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !659, file: !195, line: 310, baseType: !246, size: 320, offset: 896)
!697 = !DILocalVariable(name: "pro", scope: !650, file: !3, line: 36, type: !657)
!698 = !DILocalVariable(name: "kern", scope: !650, file: !3, line: 36, type: !657)
!699 = !DILocalVariable(name: "count", scope: !650, file: !3, line: 36, type: !657)
!700 = !DILocalVariable(name: "loopno", scope: !650, file: !3, line: 37, type: !701)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 200, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 25)
!704 = !DILocalVariable(name: "directoryPath", scope: !650, file: !3, line: 38, type: !705)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 20)
!708 = !DILocalVariable(name: "epifile", scope: !650, file: !3, line: 43, type: !246)
!709 = !DILocalVariable(name: "profile", scope: !650, file: !3, line: 44, type: !246)
!710 = !DILocalVariable(name: "kernfile", scope: !650, file: !3, line: 45, type: !246)
!711 = !DILocalVariable(name: "liveOutfile", scope: !650, file: !3, line: 46, type: !246)
!712 = !DILocalVariable(name: "episize", scope: !650, file: !3, line: 62, type: !18)
!713 = !DILocalVariable(name: "prosize", scope: !650, file: !3, line: 62, type: !18)
!714 = !DILocalVariable(name: "kernelsize", scope: !650, file: !3, line: 62, type: !18)
!715 = !DILocalVariable(name: "livevar_st_size", scope: !650, file: !3, line: 62, type: !18)
!716 = !DILocalVariable(name: "II", scope: !650, file: !3, line: 86, type: !18)
!717 = !DILocalVariable(name: "epiLength", scope: !650, file: !3, line: 87, type: !18)
!718 = !DILocalVariable(name: "prolength", scope: !650, file: !3, line: 88, type: !18)
!719 = !DILocalVariable(name: "loopitfile", scope: !650, file: !3, line: 99, type: !246)
!720 = !DILocalVariable(name: "kernelCount", scope: !650, file: !3, line: 103, type: !18)
!721 = !DILocalVariable(name: "newTC", scope: !722, file: !3, line: 112, type: !18)
!722 = distinct !DILexicalBlock(scope: !723, file: !3, line: 111, column: 3)
!723 = distinct !DILexicalBlock(scope: !650, file: !3, line: 108, column: 6)
!724 = !DILocalVariable(name: "initCGRAfile", scope: !650, file: !3, line: 129, type: !246)
!725 = !DILocation(line: 24, column: 39, scope: !650)
!726 = !DILocation(line: 26, column: 16, scope: !650)
!727 = !DILocation(line: 28, column: 15, scope: !650)
!728 = !{!729, !729, i64 0}
!729 = !{!"int", !124, i64 0}
!730 = !DILocation(line: 29, column: 15, scope: !650)
!731 = !DILocation(line: 37, column: 3, scope: !650)
!732 = !DILocation(line: 31, column: 15, scope: !650)
!733 = !DILocation(line: 37, column: 8, scope: !650)
!734 = !DILocation(line: 38, column: 3, scope: !650)
!735 = !DILocation(line: 38, column: 8, scope: !650)
!736 = !DILocation(line: 40, column: 3, scope: !650)
!737 = !DILocation(line: 41, column: 3, scope: !650)
!738 = !DILocation(line: 43, column: 3, scope: !650)
!739 = !DILocation(line: 43, column: 8, scope: !650)
!740 = !DILocation(line: 44, column: 3, scope: !650)
!741 = !DILocation(line: 44, column: 8, scope: !650)
!742 = !DILocation(line: 45, column: 3, scope: !650)
!743 = !DILocation(line: 45, column: 8, scope: !650)
!744 = !DILocation(line: 46, column: 3, scope: !650)
!745 = !DILocation(line: 46, column: 8, scope: !650)
!746 = !DILocation(line: 48, column: 3, scope: !650)
!747 = !DILocation(line: 49, column: 3, scope: !650)
!748 = !DILocation(line: 51, column: 3, scope: !650)
!749 = !DILocation(line: 52, column: 3, scope: !650)
!750 = !DILocation(line: 54, column: 3, scope: !650)
!751 = !DILocation(line: 55, column: 3, scope: !650)
!752 = !DILocation(line: 58, column: 7, scope: !650)
!753 = !DILocation(line: 36, column: 9, scope: !650)
!754 = !DILocation(line: 59, column: 7, scope: !650)
!755 = !DILocation(line: 36, column: 14, scope: !650)
!756 = !DILocation(line: 60, column: 8, scope: !650)
!757 = !DILocation(line: 36, column: 19, scope: !650)
