; ModuleID = '/home/mahesh/git_repos/ccf/scripts/CGRALib/cgra.c'
source_filename = "/home/mahesh/git_repos/ccf/scripts/CGRALib/cgra.c"
target datalayout = "e-m:e-p:32:32-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7--linux-eabi"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.pthread_attr_t = type { i32, [32 x i8] }

@totalLoops = global i32 0, align 4, !dbg !0
@thread_cond_cpu = local_unnamed_addr global i32 1, align 4, !dbg !13
@thread_cond_cgra = local_unnamed_addr global i32 0, align 4, !dbg !16
@thread_exit = local_unnamed_addr global i32 0, align 4, !dbg !18
@dynamicTCVal = local_unnamed_addr global i32 0, align 4, !dbg !20
@initCGRA = common local_unnamed_addr global i32* null, align 4, !dbg !37
@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"/epilog_ins.bin\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"/prolog_ins.bin\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"/kernel_ins.bin\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.5 = private unnamed_addr constant [32 x i8] c"\0A**********EPISIZE %d*********\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "totalLoops", scope: !2, file: !15, line: 29, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (trunk 296996) (llvm/trunk 296995)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !12)
!3 = !DIFile(filename: "/home/mahesh/git_repos/ccf/scripts/CGRALib/cgra.c", directory: "/home/mahesh/git_repos/ccf/scripts")
!4 = !{}
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!0, !13, !16, !18, !20, !22, !24, !26, !28, !30, !33, !35, !37, !39}
!13 = !DIGlobalVariableExpression(var: !14)
!14 = distinct !DIGlobalVariable(name: "thread_cond_cpu", scope: !2, file: !15, line: 32, type: !7, isLocal: false, isDefinition: true)
!15 = !DIFile(filename: "/home/mahesh/git_repos/ccf/scripts/CGRALib/cgra.h", directory: "/home/mahesh/git_repos/ccf/scripts")
!16 = !DIGlobalVariableExpression(var: !17)
!17 = distinct !DIGlobalVariable(name: "thread_cond_cgra", scope: !2, file: !15, line: 33, type: !7, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19)
!19 = distinct !DIGlobalVariable(name: "thread_exit", scope: !2, file: !15, line: 34, type: !7, isLocal: false, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21)
!21 = distinct !DIGlobalVariable(name: "dynamicTCVal", scope: !2, file: !15, line: 36, type: !11, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23)
!23 = distinct !DIGlobalVariable(name: "prolog", scope: !2, file: !15, line: 23, type: !6, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25)
!25 = distinct !DIGlobalVariable(name: "epilog", scope: !2, file: !15, line: 23, type: !6, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27)
!27 = distinct !DIGlobalVariable(name: "kernel", scope: !2, file: !15, line: 23, type: !6, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29)
!29 = distinct !DIGlobalVariable(name: "ArrPtr", scope: !2, file: !15, line: 24, type: !6, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31)
!31 = distinct !DIGlobalVariable(name: "prologPtr", scope: !2, file: !15, line: 26, type: !32, isLocal: false, isDefinition: true)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!33 = !DIGlobalVariableExpression(var: !34)
!34 = distinct !DIGlobalVariable(name: "kernelPtr", scope: !2, file: !15, line: 26, type: !32, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36)
!36 = distinct !DIGlobalVariable(name: "epilogPtr", scope: !2, file: !15, line: 26, type: !32, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38)
!38 = distinct !DIGlobalVariable(name: "initCGRA", scope: !2, file: !15, line: 28, type: !10, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40)
!40 = distinct !DIGlobalVariable(name: "pth", scope: !2, file: !15, line: 31, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !42, line: 37, baseType: !43)
!42 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/pthreadtypes.h", directory: "/home/mahesh/git_repos/ccf/scripts")
!43 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !{i32 2, !"Dwarf Version", i32 4}
!45 = !{i32 2, !"Debug Info Version", i32 3}
!46 = !{i32 1, !"wchar_size", i32 4}
!47 = !{i32 1, !"min_enum_size", i32 4}
!48 = !{!"clang version 5.0.0 (trunk 296996) (llvm/trunk 296995)"}
!49 = distinct !DISubprogram(name: "initializeParameters", scope: !3, file: !3, line: 7, type: !50, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !52)
!50 = !DISubroutineType(types: !51)
!51 = !{!11, !7}
!52 = !{!53, !54, !55, !117, !118, !119, !120, !124, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!53 = !DILocalVariable(name: "loopID", arg: 1, scope: !49, file: !3, line: 7, type: !7)
!54 = !DILocalVariable(name: "i", scope: !49, file: !3, line: 9, type: !7)
!55 = !DILocalVariable(name: "epi", scope: !49, file: !3, line: 19, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !58, line: 48, baseType: !59)
!58 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/stdio.h", directory: "/home/mahesh/git_repos/ccf/scripts")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 245, size: 1216, elements: !61)
!60 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/libio.h", directory: "/home/mahesh/git_repos/ccf/scripts")
!61 = !{!62, !63, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !84, !85, !86, !87, !90, !92, !94, !98, !101, !105, !106, !107, !108, !109, !112, !113}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 246, baseType: !11, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 251, baseType: !64, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 252, baseType: !64, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 253, baseType: !64, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 254, baseType: !64, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 255, baseType: !64, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 256, baseType: !64, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 257, baseType: !64, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 258, baseType: !64, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 260, baseType: !64, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 261, baseType: !64, size: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 262, baseType: !64, size: 32, offset: 352)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 264, baseType: !77, size: 32, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 160, size: 96, elements: !79)
!79 = !{!80, !81, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !78, file: !60, line: 161, baseType: !77, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !78, file: !60, line: 162, baseType: !82, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !78, file: !60, line: 166, baseType: !11, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 266, baseType: !82, size: 32, offset: 416)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 268, baseType: !11, size: 32, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 272, baseType: !11, size: 32, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 274, baseType: !88, size: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !89, line: 131, baseType: !8)
!89 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types.h", directory: "/home/mahesh/git_repos/ccf/scripts")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 278, baseType: !91, size: 16, offset: 544)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 279, baseType: !93, size: 8, offset: 560)
!93 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 280, baseType: !95, size: 8, offset: 568)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 284, baseType: !99, size: 32, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 154, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 293, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !89, line: 132, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !89, line: 55, baseType: !104)
!104 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 302, baseType: !9, size: 32, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 303, baseType: !9, size: 32, offset: 736)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 304, baseType: !9, size: 32, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 305, baseType: !9, size: 32, offset: 800)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 306, baseType: !110, size: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 62, baseType: !7)
!111 = !DIFile(filename: "/home/mahesh/git_repos/ccf/llvm/build/lib/clang/5.0.0/include/stddef.h", directory: "/home/mahesh/git_repos/ccf/scripts")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 308, baseType: !11, size: 32, offset: 864)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 310, baseType: !114, size: 320, offset: 896)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 320, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 40)
!117 = !DILocalVariable(name: "pro", scope: !49, file: !3, line: 19, type: !56)
!118 = !DILocalVariable(name: "kern", scope: !49, file: !3, line: 19, type: !56)
!119 = !DILocalVariable(name: "count", scope: !49, file: !3, line: 19, type: !56)
!120 = !DILocalVariable(name: "loopno", scope: !49, file: !3, line: 20, type: !121)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 200, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 25)
!124 = !DILocalVariable(name: "directoryPath", scope: !49, file: !3, line: 21, type: !125)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocalVariable(name: "epifile", scope: !49, file: !3, line: 26, type: !114)
!129 = !DILocalVariable(name: "profile", scope: !49, file: !3, line: 27, type: !114)
!130 = !DILocalVariable(name: "kernfile", scope: !49, file: !3, line: 28, type: !114)
!131 = !DILocalVariable(name: "liveOutfile", scope: !49, file: !3, line: 29, type: !114)
!132 = !DILocalVariable(name: "episize", scope: !49, file: !3, line: 45, type: !11)
!133 = !DILocalVariable(name: "prosize", scope: !49, file: !3, line: 45, type: !11)
!134 = !DILocalVariable(name: "kernelsize", scope: !49, file: !3, line: 45, type: !11)
!135 = !DILocalVariable(name: "livevar_st_size", scope: !49, file: !3, line: 45, type: !11)
!136 = !DILocalVariable(name: "II", scope: !49, file: !3, line: 69, type: !11)
!137 = !DILocalVariable(name: "epiLength", scope: !49, file: !3, line: 70, type: !11)
!138 = !DILocalVariable(name: "prolength", scope: !49, file: !3, line: 71, type: !11)
!139 = !DILocalVariable(name: "loopitfile", scope: !49, file: !3, line: 82, type: !114)
!140 = !DILocalVariable(name: "kernelCount", scope: !49, file: !3, line: 86, type: !11)
!141 = !DIExpression()
!142 = !DILocation(line: 7, column: 39, scope: !49)
!143 = !DILocation(line: 9, column: 16, scope: !49)
!144 = !DILocation(line: 11, column: 5, scope: !49)
!145 = !{!146, !146, i64 0}
!146 = !{!"any pointer", !147, i64 0}
!147 = !{!"omnipotent char", !148, i64 0}
!148 = !{!"Simple C/C++ TBAA"}
!149 = !DILocation(line: 11, column: 25, scope: !49)
!150 = !DILocation(line: 11, column: 17, scope: !49)
!151 = !DILocation(line: 11, column: 14, scope: !49)
!152 = !DILocation(line: 11, column: 30, scope: !49)
!153 = !{!154, !154, i64 0}
!154 = !{!"int", !147, i64 0}
!155 = !DILocation(line: 12, column: 29, scope: !49)
!156 = !DILocation(line: 12, column: 34, scope: !49)
!157 = !DILocation(line: 13, column: 29, scope: !49)
!158 = !DILocation(line: 20, column: 3, scope: !49)
!159 = !DILocation(line: 14, column: 34, scope: !49)
!160 = !DILocation(line: 20, column: 8, scope: !49)
!161 = !DILocation(line: 21, column: 3, scope: !49)
!162 = !DILocation(line: 21, column: 8, scope: !49)
!163 = !DILocation(line: 23, column: 3, scope: !49)
!164 = !DILocation(line: 24, column: 3, scope: !49)
!165 = !DILocation(line: 26, column: 3, scope: !49)
!166 = !DILocation(line: 26, column: 8, scope: !49)
!167 = !DILocation(line: 27, column: 3, scope: !49)
!168 = !DILocation(line: 27, column: 8, scope: !49)
!169 = !DILocation(line: 28, column: 3, scope: !49)
!170 = !DILocation(line: 28, column: 8, scope: !49)
!171 = !DILocation(line: 29, column: 3, scope: !49)
!172 = !DILocation(line: 29, column: 8, scope: !49)
!173 = !DILocation(line: 31, column: 3, scope: !49)
!174 = !DILocation(line: 32, column: 3, scope: !49)
!175 = !DILocation(line: 34, column: 3, scope: !49)
!176 = !DILocation(line: 35, column: 3, scope: !49)
!177 = !DILocation(line: 37, column: 3, scope: !49)
!178 = !DILocation(line: 38, column: 3, scope: !49)
!179 = !DILocation(line: 41, column: 7, scope: !49)
!180 = !DILocation(line: 19, column: 9, scope: !49)
