; ModuleID = 'combinedIR.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7--linux-eabi"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.pthread_attr_t = type { i32, [32 x i8] }

@.str = private unnamed_addr constant [20 x i8] c"a[%d]=%d\09 b[%d]=%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"c[%d]=%d\0A\00", align 1
@totalLoops = global i32 0, align 4
@thread_cond_cpu = local_unnamed_addr global i32 1, align 4
@thread_cond_cgra = local_unnamed_addr global i32 0, align 4
@thread_exit = local_unnamed_addr global i32 0, align 4
@dynamicTCVal = local_unnamed_addr global i32 0, align 4
@initCGRA = common local_unnamed_addr global i32* null, align 4
@epilog = common local_unnamed_addr global i32* null, align 4
@prolog = common local_unnamed_addr global i32* null, align 4
@kernel = common local_unnamed_addr global i32* null, align 4
@prologPtr = common local_unnamed_addr global i32* null, align 4
@epilogPtr = common local_unnamed_addr global i32* null, align 4
@kernelPtr = common local_unnamed_addr global i32* null, align 4
@pth = common global i32 0, align 4
@ArrPtr = common local_unnamed_addr global i32* null, align 4

!51 = !{!52, !53, !55, !57, !60, !63, !49, !64, !65, !16, !66}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 62, baseType: !49)
!54 = !DIFile(filename: "/home/mahesh/ccf/llvm/build/lib/clang/5.0.0/include/stddef.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!64 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!68 = !{!69, !72, !74, !76, !78, !80, !85, !87, !89, !91, !93, !96, !98, !100, !102}
!69 = !DIGlobalVariableExpression(var: !70)
!70 = distinct !DIGlobalVariable(name: "totalLoops", scope: !50, file: !71, line: 29, type: !49, isLocal: false, isDefinition: true)
!71 = !DIFile(filename: "/home/mahesh/ccf/scripts/CGRALib/cgra.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!72 = !DIGlobalVariableExpression(var: !73)
!73 = distinct !DIGlobalVariable(name: "thread_cond_cpu", scope: !50, file: !71, line: 32, type: !49, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75)
!75 = distinct !DIGlobalVariable(name: "thread_cond_cgra", scope: !50, file: !71, line: 33, type: !49, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "thread_exit", scope: !50, file: !71, line: 34, type: !49, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "dynamicTCVal", scope: !50, file: !71, line: 36, type: !16, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81)
!81 = distinct !DIGlobalVariable(name: "s", scope: !46, file: !42, line: 57, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 16, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "prolog", scope: !50, file: !71, line: 23, type: !63, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88)
!88 = distinct !DIGlobalVariable(name: "epilog", scope: !50, file: !71, line: 23, type: !63, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "kernel", scope: !50, file: !71, line: 23, type: !63, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "ArrPtr", scope: !50, file: !71, line: 24, type: !63, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "prologPtr", scope: !50, file: !71, line: 26, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!96 = !DIGlobalVariableExpression(var: !97)
!97 = distinct !DIGlobalVariable(name: "kernelPtr", scope: !50, file: !71, line: 26, type: !95, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99)
!99 = distinct !DIGlobalVariable(name: "epilogPtr", scope: !50, file: !71, line: 26, type: !95, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "initCGRA", scope: !50, file: !71, line: 28, type: !65, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103)
!103 = distinct !DIGlobalVariable(name: "pth", scope: !50, file: !71, line: 31, type: !104, isLocal: false, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !105, line: 37, baseType: !106)
!105 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/pthreadtypes.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!106 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!107 = !{!108, !109, !110, !168, !169, !170, !171, !172, !176, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !202, !203, !205, !206, !209, !210, !212, !213, !214, !215, !216, !217, !218}
!108 = !DILocalVariable(name: "loopID", arg: 1, scope: !46, file: !42, line: 7, type: !49)
!109 = !DILocalVariable(name: "i", scope: !46, file: !42, line: 9, type: !49)
!110 = !DILocalVariable(name: "epi", scope: !46, file: !42, line: 19, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !113, line: 48, baseType: !114)
!113 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/stdio.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !115, line: 245, size: 1216, elements: !116)
!115 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/libio.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !137, !138, !139, !140, !143, !145, !147, !151, !154, !158, !159, !160, !161, !162, !163, !164}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !114, file: !115, line: 246, baseType: !16, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !114, file: !115, line: 251, baseType: !67, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !114, file: !115, line: 252, baseType: !67, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !114, file: !115, line: 253, baseType: !67, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !114, file: !115, line: 254, baseType: !67, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !114, file: !115, line: 255, baseType: !67, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !114, file: !115, line: 256, baseType: !67, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !114, file: !115, line: 257, baseType: !67, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !114, file: !115, line: 258, baseType: !67, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !114, file: !115, line: 260, baseType: !67, size: 32, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !114, file: !115, line: 261, baseType: !67, size: 32, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !114, file: !115, line: 262, baseType: !67, size: 32, offset: 352)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !114, file: !115, line: 264, baseType: !130, size: 32, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !115, line: 160, size: 96, elements: !132)
!132 = !{!133, !134, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !131, file: !115, line: 161, baseType: !130, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !131, file: !115, line: 162, baseType: !135, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !131, file: !115, line: 166, baseType: !16, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !114, file: !115, line: 266, baseType: !135, size: 32, offset: 416)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !114, file: !115, line: 268, baseType: !16, size: 32, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !114, file: !115, line: 272, baseType: !16, size: 32, offset: 480)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !114, file: !115, line: 274, baseType: !141, size: 32, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !142, line: 131, baseType: !64)
!142 = !DIFile(filename: "/usr/arm-linux-gnueabi/include/bits/types.h", directory: "/home/mahesh/git_repos/ullmann/test/simple_loop")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !114, file: !115, line: 278, baseType: !144, size: 16, offset: 544)
!144 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !114, file: !115, line: 279, baseType: !146, size: 8, offset: 560)
!146 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !114, file: !115, line: 280, baseType: !148, size: 8, offset: 568)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !114, file: !115, line: 284, baseType: !152, size: 32, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !115, line: 154, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !114, file: !115, line: 293, baseType: !155, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !142, line: 132, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !142, line: 55, baseType: !157)
!157 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !114, file: !115, line: 302, baseType: !52, size: 32, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !114, file: !115, line: 303, baseType: !52, size: 32, offset: 736)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !114, file: !115, line: 304, baseType: !52, size: 32, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !114, file: !115, line: 305, baseType: !52, size: 32, offset: 800)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !114, file: !115, line: 306, baseType: !53, size: 32, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !114, file: !115, line: 308, baseType: !16, size: 32, offset: 864)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !114, file: !115, line: 310, baseType: !165, size: 320, offset: 896)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 320, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 40)
!168 = !DILocalVariable(name: "pro", scope: !46, file: !42, line: 19, type: !111)
!169 = !DILocalVariable(name: "kern", scope: !46, file: !42, line: 19, type: !111)
!170 = !DILocalVariable(name: "count", scope: !46, file: !42, line: 19, type: !111)
!171 = !DILocalVariable(name: "arch", scope: !46, file: !42, line: 19, type: !111)
!172 = !DILocalVariable(name: "loopno", scope: !46, file: !42, line: 20, type: !173)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 200, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 25)
!176 = !DILocalVariable(name: "directoryPath", scope: !46, file: !42, line: 21, type: !177)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 160, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 20)
!180 = !DILocalVariable(name: "epifile", scope: !46, file: !42, line: 26, type: !165)
!181 = !DILocalVariable(name: "profile", scope: !46, file: !42, line: 27, type: !165)
!182 = !DILocalVariable(name: "kernfile", scope: !46, file: !42, line: 28, type: !165)
!183 = !DILocalVariable(name: "liveOutfile", scope: !46, file: !42, line: 29, type: !165)
!184 = !DILocalVariable(name: "archfile", scope: !46, file: !42, line: 30, type: !165)
!185 = !DILocalVariable(name: "episize", scope: !46, file: !42, line: 49, type: !16)
!186 = !DILocalVariable(name: "prosize", scope: !46, file: !42, line: 49, type: !16)
!187 = !DILocalVariable(name: "kernelsize", scope: !46, file: !42, line: 49, type: !16)
!188 = !DILocalVariable(name: "livevar_st_size", scope: !46, file: !42, line: 49, type: !16)
!189 = !DILocalVariable(name: "CGRA_XDim", scope: !46, file: !42, line: 50, type: !16)
!190 = !DILocalVariable(name: "CGRA_YDim", scope: !46, file: !42, line: 50, type: !16)
!191 = !DILocalVariable(name: "token", scope: !46, file: !42, line: 58, type: !67)
!192 = !DILocalVariable(name: "X_flag", scope: !46, file: !42, line: 59, type: !16)
!193 = !DILocalVariable(name: "Y_flag", scope: !46, file: !42, line: 59, type: !16)
!194 = !DILocalVariable(name: "line", scope: !44, file: !42, line: 63, type: !177)
!195 = !DILocalVariable(name: "__s1_len", scope: !196, file: !42, line: 71, type: !53)
!196 = distinct !DILexicalBlock(scope: !197, file: !42, line: 71, column: 25)
!197 = distinct !DILexicalBlock(scope: !198, file: !42, line: 71, column: 24)
!198 = distinct !DILexicalBlock(scope: !199, file: !42, line: 70, column: 17)
!199 = distinct !DILexicalBlock(scope: !200, file: !42, line: 69, column: 20)
!200 = distinct !DILexicalBlock(scope: !201, file: !42, line: 68, column: 13)
!201 = distinct !DILexicalBlock(scope: !41, file: !42, line: 67, column: 13)
!202 = !DILocalVariable(name: "__s2_len", scope: !196, file: !42, line: 71, type: !53)
!203 = !DILocalVariable(name: "__s2", scope: !204, file: !42, line: 71, type: !57)
!204 = distinct !DILexicalBlock(scope: !196, file: !42, line: 71, column: 25)
!205 = !DILocalVariable(name: "__result", scope: !204, file: !42, line: 71, type: !16)
!206 = !DILocalVariable(name: "__s1_len", scope: !207, file: !42, line: 73, type: !53)
!207 = distinct !DILexicalBlock(scope: !208, file: !42, line: 73, column: 25)
!208 = distinct !DILexicalBlock(scope: !198, file: !42, line: 73, column: 24)
!209 = !DILocalVariable(name: "__s2_len", scope: !207, file: !42, line: 73, type: !53)
!210 = !DILocalVariable(name: "__s2", scope: !211, file: !42, line: 73, type: !57)
!211 = distinct !DILexicalBlock(scope: !207, file: !42, line: 73, column: 25)
!212 = !DILocalVariable(name: "__result", scope: !211, file: !42, line: 73, type: !16)
!213 = !DILocalVariable(name: "CGRAsize", scope: !46, file: !42, line: 95, type: !16)
!214 = !DILocalVariable(name: "II", scope: !46, file: !42, line: 119, type: !16)
